-- egetask определение

CREATE TABLE egetask (
	ID INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
	tasknumber INTEGER NOT NULL,
	"text" TEXT NOT NULL
);


INSERT INTO egetask (tasknumber,"text") VALUES
	 (1,'На рисунке схема дорог N-ского района изображена в виде графа, в таблице содержатся сведения о протяжённости каждой из этих дорог (в километрах).
Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какова сумма протяжённостей дорог из пункта E в пункт A и из пункта B в пункт C.
В ответе запишите целое число'),
	 (2,'Миша заполнял таблицу истинности логической функции 
F
=
(
(
x
≡
¬
y
)
→
¬
(
w
→
x
)
)
∨
¬
z
F=((x≡¬y)→¬(w→x))∨¬z, но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных 
w
,
x
,
y
,
z
w,x,y,z.');

